from typing import Literal, TypeAlias

POSITION_TITLES: TypeAlias = Literal[
    "Власник",
    "CEO",
    "Асистент СЕО",
    "Керуючий",
    "HR",
    "Головний бухгалтер",
    "Бухгалтер",
    "Менеджер з продажу",
    "Менеджер по флористам",
    "Логіст",
    "Працівник складу",
    "Флорист",
]

positions_map: dict[POSITION_TITLES, int] = {
    "Власник": 1,
    "CEO": 2,
    "Асистент СЕО": 3,
    "Керуючий": 4,
    "HR": 4,
    "Головний бухгалтер": 4,
    "Бухгалтер": 4,
    "Менеджер з продажу": 5,
    "Менеджер по флористам": 5,
    "Логіст": 5,
    "Працівник складу": 5,
    "Флорист": 5,
}


